# -*- coding: utf-8 -*-

_author_ = 'luwt'
_date_ = '2023/8/2 14:31'


OVERVIEW_TEXT = ('数据字典详情页，用来维护当前数据字典类型下的列表值'
                 '<p class="import">需要注意的是，所有操作必须在点击保存按钮后才会保存修改，否则离开页面，将丢弃所有修改</p>')

DATA_DICT_DETAIL_LABEL_TEXT = '数据字典表格：'
DATA_DICT_DETAIL_HELP_TEXT = '数据字典系统内置了一套默认的下拉值列表，可点击【同步默认数据字典】获取默认值'

COLOR_DIALOG_LABEL_TEXT = '颜色选择：'
COLOR_DIALOG_HELP_TEXT = ('<p>双击字体颜色或背景色单元格，可打开颜色选择对话框，在选择颜色后，将会实时渲染实际颜色效果</p>'
                          '<p class="import">如果【clear】当前颜色，请保存并退出颜色对话框，'
                          '如果需要再次选择颜色，重新打开对话框以选择颜色。'
                          '清除颜色后，如果不退出对话框，那么需要手动将 alpha 调整大于0，否则颜色无法显示，'
                          '当 alpha 值等于0时，颜色为透明状态，另外需要将颜色选择框右侧的滑块拉至顶点，'
                          '或手动调整三原色数值，选择合适的颜色值</p>')
